app/views/tasks/new.html.erb


<p><%= Task.pasados(current_user).to_a %></p>
---
SELECT date FROM "tasks" WHERE (user_id = 1 AND date <= '2013-04-19') LIMIT 1