app/controllers/tasks_controller.rb

	def create
    @task = current_user.tasks.create(params[:task])
    @tasks = current_user.tasks.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1