app/controllers/tasks_controller.rb

	def new
		@task = Task.new
		@tasks = Task.all
---
SELECT date FROM "tasks" WHERE (user_id = 1 AND date <= '2013-04-19') LIMIT 1

	def create
      @task = Task.new(params[:task])
      @tasks = Task.all
      if @task.save
---
SELECT "tasks".* FROM "tasks"
INSERT INTO "tasks" ("created_at", "date", "days_before", "description", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sat, 13 Apr 2013 17:21:13 UTC +00:00], ["date", nil], ["days_before", nil], ["description", nil], ["title", nil], ["updated_at", Sat, 13 Apr 2013 17:21:13 UTC +00:00]]

   	def update
   		if @task.update_attributes(params[:task])
---
UPDATE "tasks" SET "title" = 'Cambair', "description" = 'Mudar todo de la casa', "days_before" = 2, "updated_at" = '2013-04-13 20:45:18.017193' WHERE "tasks"."id" = 12

	    def find_task
	      @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "8"]]